window.onload = function() {

  var tables = [];

  /*---------------
   *---- 模板 -----
  tables.push({
    id: '',
    ship: [
      ['松輪改', 'なし', 'なし', 'なし', '0'],
    ]
  });
  -----------------*/

  tables.push({
    id: 'shien2',
    ship: [
      ['Гангут два', '46cm三連装砲', '46cm三連装砲', '38cm連装砲改', '38cm連装砲改'],
      ['榛名改二', '46cm三連装砲', '46cm三連装砲', '46cm三連装砲', '46cm三連装砲'],
      ['比叡改二', '16inch三連装砲', 'Mk.7,38cm四連装砲改', '30.5cm三連装砲改', '30.5cm三連装砲改'],
      ['飛龍改二', '九九式艦爆(江草隊)', '九九式艦爆(江草隊)', 'TBF', 'TBF'],
      ['夕立改二', 'QF 4.7inch砲 Mk.XII改', '12.7cm連装砲D型改二', '22号対水上電探', '0'],
      ['島風改', '130mm B-13連装砲', '22号対水上電探', '130mm B-13連装砲', '0'],
    ]
  });

  tables.push({
    id: 'shien1',
    ship: [
      ['金剛改二', '16inch Mk.I三連装砲', '16inch Mk.I三連装砲', '46cm三連装砲', '46cm三連装砲'],
      ['霧島改二', '46cm三連装砲', '46cm三連装砲', '38cm連装砲', '38cm連装砲'],
      ['Warspite改', '38cm四連装砲', '41cm連装砲', '試製41cm三連装砲', '38.1cm Mk.I連装砲'],
      ['蒼龍改二', '彗星(江草隊)', '九九式艦爆(江草隊)', '九九式艦爆(江草隊)', 'FM-2'],
      ['綾波改二', '130mm B-13連装砲', '5inch単装砲 Mk.30', '22号対水上電探改四(後期調整型)', '0'],
      ['長波改二', 'QF 4.7inch砲 Mk.XII改', '12.7cm連装砲C型改二', '22号対水上電探', '0'],
    ]
  });

  tables.push({
    id: 'Bm8',
    ship: [
      ['阿武隈改二', '甲標的 甲型', '甲標的 甲型', '甲標的 甲型', '0'],
      ['綾波改二', '130mm B-13連装砲', '5inch単装砲 Mk.30', '22号対水上電探改四(後期調整型)', '0'],
      ['長波改二', 'QF 4.7inch砲 Mk.XII改', '12.7cm連装砲C型改二', '22号対水上電探', '0'],
      ['夕立改二', 'QF 4.7inch砲 Mk.XII改', '12.7cm連装砲D型改二', '22号対水上電探', '0'],
      ['江风改二', '12.7cm连装高角炮（后期型）', '12.7cm连装高角炮（后期型）', '22号对水上电探', '0'],
      ['Ташкент改', '5inch単装砲 Mk.30','5inch単装砲 Mk.30改+GFCS Mk.37', '22号対水上電探', '22号対水上電探'],
    ]
  });

  tables.push({
    id: '5-5',
    ship: [
      ['Nelson改', '16inch Mk.I三連装砲+AFCT改', '38cm四連装砲改', '九一式徹甲弾', '零式水上偵察機11型乙(熟練)', '0'],
      ['Intrepid改', '天山一二型(友永隊)', '彗星二二型(六三四空)', '烈風 一一型', '試製烈風 後期型', '0'],
      ['武蔵改二', '試製51cm連装砲', '46cm三連装砲', '零式水上偵察機11型乙', '二式水戦改', '一式徹甲弾'],
      ['熊野改二', '零式水上観測機', '二式水戦改', '二式水戦改', '強風改', '0'],
      ['長門改二', '試製41cm三連装砲', '試製41cm三連装砲', '零式水上偵察機11型乙(熟練)', '九一式徹甲弾', '0'],
      ['鈴谷改二', '二式水戦改', '二式水戦改', '二式水戦改', '強風改', '0'],
    ]
  });

  tables.push({
    id: '4-5',
    ship: [
      ['妙高改二', '20.3cm(2号)連装砲', '20.3cm(2号)連装砲', '九八式水上偵察機(夜偵)', '三式弾'],
      ['大鳳改', '天山一二型(友永隊)', '流星改', '彗星二二型(六三四空)', '試製烈風 後期型'],
      ['鳥海改二', '20.3cm(3号)連装砲', '20.3cm(3号)連装砲', '零式水上観測機', '三式弾'],
      ['筑摩改二', '20.3cm(2号)連装砲', '20.3cm(2号)連装砲', '強風改', '三式弾'],
      ['翔鶴改二甲', '流星改', '流星改', '烈風 一一型', '彩雲'],
      ['瑞鶴改二甲', '天山一二型(村田隊)', '流星改', '流星改', '試製烈風 後期型'],
    ]
  });

  tables.push({
    id: '2-5',
    ship: [
      ['瑞鳳改二乙', '天山一二型(村田隊)', '彗星(江草隊)', '烈風 一一型', '彩雲'],
      ['千代田航改二', '天山一二型(友永隊)', '流星改', '彗星二二型(六三四空)', '彩雲'],
      ['阿武隈改二', '甲標的 甲型', '甲標的 甲型', '甲標的 甲型', '0'],
      ['長波改二', 'QF 4.7inch砲 Mk.XII改', '12.7cm連装砲C型改二', '22号対水上電探', '0'],
      ['夕立改二', 'QF 4.7inch砲 Mk.XII改', '12.7cm連装砲D型改二', '22号対水上電探', '0'],
      ['綾波改二', '130mm B-13連装砲', '5inch単装砲 Mk.30', '22号対水上電探改四(後期調整型)', '0'],
    ]
  });

  tables.push({
    id: '1-6',
    ship: [
      ['涼月改', '10cm連装高角砲+高射装置', '10cm連装高角砲+高射装置', '13号対空電探改', '0'],
      ['江風改二', '12.7cm連装高角砲(後期型)', '12.7cm連装高角砲(後期型)', '22号対水上電探', '0'],
      ['長波改二', 'QF 4.7inch砲 Mk.XII改', '12.7cm連装砲C型改二', '22号対水上電探', '0'],
      ['夕立改二', 'QF 4.7inch砲 Mk.XII改', '12.7cm連装砲D型改二', '22号対水上電探', '0'],
      ['綾波改二', '130mm B-13連装砲', '5inch単装砲 Mk.30', '22号対水上電探改四(後期調整型)', '0'],
      ['五十鈴改二', '三式水中探信儀', '三式爆雷投射機', '二式爆雷', '0'],
    ]
  });

  tables.push({
    id: '1-5',
    ship: [
      ['国後改', 'Type124 ASDIC', '三式爆雷投射機', '二式爆雷', '0'],
      ['木曾改二',　'甲標的 甲型', '三式水中探信儀', '三式爆雷投射機', '0'],
      ['北上改二', '甲標的 甲型', '三式水中探信儀', '三式爆雷投射機', '0'],
      ['Gotland改',　'三式水中探信儀', '三式爆雷投射機', 'なし', 'なし'],
    ]
  });

  tables.push({
    id: '3-5',
    ship: [
      ['日進甲', '瑞雲12型', '瑞雲(六三四空)', '試製晴嵐', '甲標的 甲型'],
      ['神通改二', '20.3cm(2号)連装砲', '20.3cm(2号)連装砲', '零式水上偵察機', '0'],
      ['長波改二', 'QF 4.7inch砲 Mk.XII改', '12.7cm連装砲C型改二', '22号対水上電探', '0'],
      ['夕立改二', 'QF 4.7inch砲 Mk.XII改', '12.7cm連装砲D型改二', '22号対水上電探', '0'],
      ['綾波改二', '130mm B-13連装砲', '5inch単装砲 Mk.30', '22号対水上電探改四(後期調整型)', '0'],
      ['阿武隈改二', '甲標的 甲型', '甲標的 甲型', '甲標的 甲型', '0'],
    ]
  });

  

  tables.push({
    id: 'Bm7',
    ship: [
      ['Ташкент改', '5inch単装砲 Mk.30','5inch単装砲 Mk.30改+GFCS Mk.37', '22号対水上電探', '22号対水上電探'],
      ['鳥海改二', '20.3cm(3号)連装砲', '20.3cm(3号)連装砲', '三式弾', '零式水上偵察機11型乙(熟練)'],
      ['長波改二', 'QF 4.7inch砲 Mk.XII改', '12.7cm連装砲C型改二', '22号対水上電探', '0'],
      ['夕立改二', 'QF 4.7inch砲 Mk.XII改', '12.7cm連装砲D型改二', '22号対水上電探', '0'],
      ['綾波改二', '130mm B-13連装砲', '5inch単装砲 Mk.30', '22号対水上電探改四(後期調整型)', '0'],
      ['由良改二', '甲標的 甲型', '強風改', '瑞雲', '0'],
    ]
  });

  tables.push({
    id: 'Bm6',
    ship: [
      ['瑞鳳改二乙', '流星改', '流星改', '流星改', '彩雲'],
      ['隼鷹改二', '天山一二型(友永隊)', '天山一二型(村田隊)', '彗星二二型(六三四空)', '烈風 一一型'],
      ['綾波改二', '130mm B-13連装砲', '5inch単装砲 Mk.30', '22号対水上電探改四(後期調整型)', '0'],
      ['夕立改二', 'QF 4.7inch砲 Mk.XII改', '12.7cm連装砲D型改二', '22号対水上電探', '0'],
      ['長波改二', 'QF 4.7inch砲 Mk.XII改', '12.7cm連装砲C型改二', '22号対水上電探', '0'],
      ['涼月改', '10cm連装高角砲+高射装置', '10cm連装高角砲+高射装置', '13号対空電探改', '0'],
    ]
  });

  tables.push({
    id: 'Bm4',
    ship: [
      ['長門改二', '試製41cm三連装砲', '試製41cm三連装砲', '二式水戦改', '九一式徹甲弾', '0'],
      ['伊勢改二', '16inch Mk.I三連装砲+AFCT改', '試製41cm三連装砲', '強風改' ,'二式水戦改', '九一式徹甲弾'],
      ['日向改二', '38cm四連装砲改', '16inch三連装砲 Mk.7', '強風改' ,'二式水戦改', '九一式徹甲弾'],
      ['鈴谷改二', '20.3cm(3号)連装砲', '20.3cm(3号)連装砲', '二式水戦改', '二式水戦改', '0'],
      ['阿武隈改二', '甲標的 甲型', 'Type124 ASDIC', '三式爆雷投射機', '0', '0'],
      ['涼月改', '10cm連装高角砲+高射装置', '10cm連装高角砲+高射装置', '13号対空電探改', '0', '0'],
    ]
  });

  tables.push({
    id: 'Bm3',
    ship: [
      ['神通改二', '20.3cm(2号)連装砲', '20.3cm(2号)連装砲', '零式水上偵察機', '0'],
      ['阿武隈改二', '甲標的 甲型', '甲標的 甲型', '甲標的 甲型', '0'],
      ['由良改二', '甲標的 甲型', '甲標的 甲型', '甲標的 甲型', '0'],
      ['綾波改二', '130mm B-13連装砲', '5inch単装砲 Mk.30', '22号対水上電探改四(後期調整型)', '0'],
      ['長波改二', 'QF 4.7inch砲 Mk.XII改', '12.7cm連装砲C型改二', '22号対水上電探', '0'],
      ['涼月改', '10cm連装高角砲+高射装置', '10cm連装高角砲+高射装置', '13号対空電探改', '0'],
    ]
  });

  tables.push({
    id: 'Bw9',
    ship: [
      ['長門改二', '試製41cm三連装砲', '試製41cm三連装砲', '零式水上偵察機11型乙(熟練)', '九一式徹甲弾'],
      ['瑞鶴改二甲', '天山一二型(友永隊)', '彗星二二型(六三四空)', '試製烈風 後期型', '試製烈風 後期型'],
      ['翔鶴改二甲', '天山一二型(村田隊)', '彗星(江草隊)', '烈風 一一型', '彩雲'],
      ['鳥海改二', '20.3cm(3号)連装砲', '20.3cm(3号)連装砲', '三式弾', '零式水上偵察機11型乙(熟練)'],
      ['長波改二', 'QF 4.7inch砲 Mk.XII改', '12.7cm連装砲C型改二', '22号対水上電探', '0'],
      ['涼月改', '10cm連装高角砲+高射装置', '10cm連装高角砲+高射装置', '13号対空電探改', '0'],
    ]
  });

  tables.push({
    id: 'Bw8',
    ship: [
      ['長門改二', '試製41cm三連装砲', '試製41cm三連装砲', '零式水上偵察機11型乙(熟練)', '九一式徹甲弾'],
      ['瑞鶴改二甲', '天山一二型(友永隊)', '彗星二二型(六三四空)', '試製烈風 後期型', '試製烈風 後期型'],
      ['翔鶴改二甲', '天山一二型(村田隊)', '彗星(江草隊)', '烈風 一一型', '彩雲'],
      ['鳥海改二', '20.3cm(3号)連装砲', '20.3cm(3号)連装砲', '三式弾', '零式水上偵察機11型乙(熟練)'],
      ['長波改二', 'QF 4.7inch砲 Mk.XII改', '12.7cm連装砲C型改二', '22号対水上電探', '0'],
      ['Jervis改', '三式水中探信儀', '二式爆雷', '九四式爆雷投射機', '0'],
    ]
  });

  tables.push({
    id: 'Bw7',
    ship: [
      ['Saratoga Mk.II', '天山一二型(友永隊)', '天山一二型(村田隊)', '彗星二二型(六三四空)', '烈風 一一型'],
      ['瑞鳳改二乙', '流星改', '流星改', '流星改', '彩雲'],
      ['Pola改', '20.3cm(3号)連装砲', '20.3cm(3号)連装砲', '零式水上偵察機', 'GFCS Mk.37'],
      ['阿武隈改二', '甲標的 甲型', '甲標的 甲型', '甲標的 甲型', '0'],
      ['綾波改二', '130mm B-13連装砲', '5inch単装砲 Mk.30', '22号対水上電探改四(後期調整型)', '0'],
      ['長波改二', 'QF 4.7inch砲 Mk.XII改', '12.7cm連装砲C型改二', '22号対水上電探', '0'],
    ]
  });

  tables.push({
    id: 'Bw6',
    ship: [
      ['瑞鳳改二乙', '流星改', '流星改', '流星改', '彩雲'],
      ['隼鷹改二', '天山一二型(友永隊)', '天山一二型(村田隊)', '彗星二二型(六三四空)', '烈風 一一型'],
      ['綾波改二', '130mm B-13連装砲', '5inch単装砲 Mk.30', '22号対水上電探改四(後期調整型)', '0'],
      ['夕立改二', 'QF 4.7inch砲 Mk.XII改', '12.7cm連装砲D型改二', '22号対水上電探', '0'],
      ['長波改二', 'QF 4.7inch砲 Mk.XII改', '12.7cm連装砲C型改二', '22号対水上電探', '0'],
      ['涼月改', '10cm連装高角砲+高射装置', '10cm連装高角砲+高射装置', '13号対空電探改', '0'],
    ]
  });

  tables.push({
    id: '#38',
    ship: [
      ['睦月改二', 'ドラム缶(輸送用)', '大発動艇', '大発動艇', '0'],
      ['如月改二', 'ドラム缶(輸送用)', '大発動艇', '大発動艇', '0'],
      ['皐月改二', 'ドラム缶(輸送用)', 'ドラム缶(輸送用)', 'ドラム缶(輸送用)', '0'],
      ['弥生改二', 'ドラム缶(輸送用)', 'ドラム缶(輸送用)', 'ドラム缶(輸送用)', '0'],
      ['文月改二', 'ドラム缶(輸送用)', 'ドラム缶(輸送用)', 'ドラム缶(輸送用)', '0'],
      ['日振改', 'なし', 'なし', 'なし', '0'],
    ]
  });

  tables.push({
    id: '#37',
    ship: [
      ['睦月改二', 'ドラム缶(輸送用)', '大発動艇', '大発動艇', '0'],
      ['如月改二', 'ドラム缶(輸送用)', '大発動艇', '大発動艇', '0'],
      ['皐月改二', 'ドラム缶(輸送用)', 'ドラム缶(輸送用)', 'ドラム缶(輸送用)', '0'],
      ['弥生改二', 'ドラム缶(輸送用)', 'なし', 'なし', '0'],
      ['文月改二', 'なし', 'なし', 'なし', '0'],
      ['龍田改二', 'なし', 'なし', 'なし', '0'],
    ]
  });

  tables.push({
    id: '#21',
    ship: [
      ['睦月改二', '大発動艇', '大発動艇', '大発動艇', '0'],
      ['如月改二', 'ドラム缶(輸送用)', 'ドラム缶(輸送用)', 'ドラム缶(輸送用)', '0'],
      ['皐月改二', 'ドラム缶(輸送用)', 'なし', 'なし', '0'],
      ['弥生改二', 'ドラム缶(輸送用)', 'なし', 'なし', '0'],
      ['龍田改二', 'ドラム缶(輸送用)', 'なし', 'なし', '0'],
      ['日振改', 'なし', 'なし', 'なし', '0'],
    ]
  });

  tables.push({
    id: '#5',
    ship: [
      ['睦月改二', '大発動艇', '大発動艇', '大発動艇', '0'],
      ['如月改二', 'なし', 'なし', 'なし', '0'],
      ['龍田改二', 'なし', 'なし', 'なし', '0'],
      ['日振改', 'なし', 'なし', 'なし', '0'],
      ['大東改', 'なし', 'なし', 'なし', '0'],
    ]
  });

  tables.push({
    id: '#B1',
    ship: [
      ['千歳甲', 'なし', 'なし', 'なし', '0'],
      ['龍田改二', 'なし', 'なし', 'なし', '0'],
      ['睦月改二', 'なし', 'なし', 'なし', '0'],
      ['如月改二', 'なし', 'なし', 'なし', '0'],
      ['皐月改二', 'なし', 'なし', 'なし', '0'],
      ['弥生改二', 'なし', 'なし', 'なし', '0'],
    ]
  });

  tables.push({
    id: '#A2',
    ship: [
      ['松輪改', 'なし', 'なし', 'なし', '0'],
      ['日振改', 'なし', 'なし', 'なし', '0'],
      ['大東改', 'なし', 'なし', 'なし', '0'],
      ['福江改', 'なし', 'なし', 'なし', '0'],
      ['対馬改', 'なし', 'なし', 'なし', '0'],
    ]
  });

  tables.push({
    id: '#2',
    ship: [
      ['松輪改', 'なし', 'なし', 'なし', '0'],
      ['日振改', 'なし', 'なし', 'なし', '0'],
      ['大東改', 'なし', 'なし', 'なし', '0'],
      ['福江改', 'なし', 'なし', 'なし', '0'],
    ]
  });

  tables.forEach(function(table, i, a) {
                   var len = a.length;
                   return createTable(table, i, len);
                 });
}

//新建一个table，每次接收一个table对象，每个table有id、table兩属性
function createTable(table, i, len) {
  //获得table元素
  var tb = document.getElementById(table.id);

  //获得编成列表
  var ship = table.ship;
  
  //生成表
  for(var i = 0; i < ship.length; i++) {
    var tr = document.createElement("tr");
    for(var j = 0; j < ship[i].length; j++) {
      //无法装备的设为灰色背景 
      if("0" === ship[i][j]) {
        var td = document.createElement("td");
        td.id = 'cant_eqp';
        td.innerText = " ";
        tr.appendChild(td);
      }else if(0 === j) {
        var td = document.createElement("td");
        var span = document.createElement("span");
        span.innerText = ship[i][j];
        td.appendChild(span);
        tr.appendChild(td);
      }else {
        var td = document.createElement("td");
        td.innerText = ship[i][j];
        tr.appendChild(td);
      }
    }
    tb.appendChild(tr);
  }
}